The host element Id for the boundary conditions.
  Namespace:   Autodesk.Revit.DB.Structure
  Assembly:   RevitAPI  (in RevitAPI.dll) Version: 16.0.0.0 (16.0.0.0)
  Since:  2016
 Syntax
  C#
public ElementId HostElementId { get; }
  Visual Basic
Public ReadOnly Property HostElementId As ElementId
	Get
  Visual C++
public:
property ElementId^ HostElementId {
	ElementId^ get ();
}
 See Also
  BoundaryConditions Class
  Autodesk.Revit.DB.Structure Namespace